{
  "espetaculos": [
    {
      "id": 1,
      "nome": "O Lago dos Cisnes",
      "titulo": "O Lago dos Cisnes: conheça um dos ballets de repertório mais famosos do mundo",
      "resumo": "Em 4 de março de 1877, um novo balé estreou no Teatro Bolshoi em Moscou – O Lago dos Cisnes. Esta foi aprimeira grande partitura de balé composta por Piotr Ilitch Tchaikovsky, que mais tarde escreveria e comporia O Quebra-Nozes e A Bela Adormecida. Os críticos, no entanto, não se comoveram , e Tchaikovsky mal sabia que O Lago dos Cisnes se tornaria o balé clássico mais conhecido e atemporal, e um dos balés mais populares de todos os tempos.",
      "origens": "Na verdade, não há evidências de onde surgiu a ideia do enredo de O Lago dos Cisnes , ou o que inspirou seu escritor. A teoria mais aceita é que o conteúdo do balé é baseado em um conto popular russo ou alemão. Reza a lenda que, em 1871, Tchaikovsky compôs um balé-pantomima infantil, O Lago dos Cisnes , para seus sobrinhos e sobrinhas. Alguns contemporâneos de Tchaikovsky lembram-se do fascínio do compositor pela história de vida do rei bávaro Ludwig II, que supostamente era chamado de 'O Rei dos Cisnes' e morreu em circunstâncias misteriosas, afogando-se em um lago. Isso provavelmente serviu de principal inspiração para Tchaikovsky criar sua personagem principal, Odette, o Príncipe Siegfried.",
      "trama": "Como muitas histórias de amor poderosas, o balé mágico O Lago dos Cisnes tem uma narrativa clássica de amor trágico, contando a história do amor condenado entre o Príncipe Siegfried e a Princesa Odette. Certa noite, caçando, o Príncipe Siegfried persegue um grupo de cisnes – um dos quais se transforma em uma jovem, a Princesa Odette, que explica que ela e seus companheiros foram transformados em cisnes pelo maligno Barão Von Rothbart (que também é o mentor de Siegfried). A maldição só pode ser quebrada por um homem que promete seu coração exclusivamente a Odette. Felizmente, o Príncipe Siegfried declara seu amor por Odette, prometendo lealdade eterna. Em uma grande recepção no palácio, Siegfried precisa escolher uma noiva, mas só consegue pensar em Odette. Rothbart engana Siegfried para que ele traia Odette, fazendo-o pensar que está dançando com ela, quando na verdade está dançando com uma mulher misteriosa, Odile – filha de Rothbart. Sem saber disso, Siegfried declara seu amor por Odile, a enganadora Cisne Negro, e pede sua mão em casamento. Odette testemunha toda a cena. Siegfried percebe seu erro tarde demais e segue Odette até o lago para implorar seu perdão. Embora Odette perdoe Siegfried, ela fica arrasada pelo fato de ele ter quebrado o voto (e, portanto, não poder quebrar o feitiço devido à promessa anterior de Siegfried de se casar com Odile). A morte é a única maneira dos amantes escaparem de Rothbart. Eles pulam no lago e se afogam, destruindo os poderes do feiticeiro maligno. É esse ato de amor que quebra o feitiço de Rothbart, permitindo que Odette e Siegfried se unam em amor eterno. (Esta é a história mais conhecida, mas houve muitas variações dela, algumas com um final mais feliz).",
      "coreografia": "O Lago dos Cisnes tem algumas das coreografias mais exclusivas e icônicas da história do balé e é conhecido como uma das produções mais exigentes e icônicas para um corpo de balé dançar. A coreografia é tecnicamente desafiadora – o corpo de baile precisa se mover em uníssono para criar o efeito de um bando de cisnes. Embora os bailarinos façam com que pareça fácil, muita força e resistência são necessárias para executar os movimentos delicados, as formações complexas e as ondulações sincronizadas, especialmente na ponta dos pés . De fato, os braços ondulantes de cisne do corpo de baile se tornaram um símbolo icônico do balé clássico. O Lago dos Cisnes representa a luta do bem contra o mal, retratada por dois cisnes opostos – o vulnerável e delicado Cisne Branco e o sedutor e enganador Cisne Negro. Inicialmente, os personagens eram interpretados por duas bailarinas diferentes, mas isso evoluiu para o famoso papel duplo, com os cisnes Branco e Negro dançados pela mesma bailarina, criando um dos papéis mais desafiadores que uma bailarina pode desempenhar. Retratar dois personagens contrastantes em uma única apresentação, juntamente com uma dança primorosa (incluindo os famosos 32 giros de fouetté do balé), exige uma bailarina excepcional.",
      "legado": "Muitas interpretações de O Lago dos Cisnes foram feitas – notadamente a versão de Frederick Ashton de 1987 (que teve o maior número de remontagens pelo Royal Ballet), e, de fato, a inovadora versão exclusivamente masculina de O Lago dos Cisnes de Matthew Bourne, de 2007, que foi sem dúvida a maior reviravolta no balé desde a remontagem do Mariinsky. Nesta versão, é o Príncipe que luta contra a repressão e anseia por liberdade, e que precisa de amor para se manter seguro. O Lago dos Cisnes é uma jornada emocionante por tantos estados e emoções humanas que quase todos se identificam com ele e com seu lema principal: 'O amor vence tudo'.  É hoje o balé mais apresentado no mundo e continua a encantar e encantar plateias do mundo todo.",
      "imagem": "assets/Img/swan_lake.jpeg",
      "localizacao": {
        "cidade": "Moscou",
        "pais": "Rússia",
        "teatro": "Teatro Bolshoi",
        "latitude": 55.7596,
        "longitude": 37.619,
        "ano": 1877
      },
      "mais_imagens": [
        {
          "id": 1,
          "imagem": "assets/Img/swan-lake/swanL1.jpg"
        },
        {
          "id": 2,
          "imagem": "assets/Img/swan-lake/swanL2.jpg"
        },
        {
          "id": 3,
          "imagem": "assets/Img/swan-lake/swanL3.jpg"
        }
      ]
    },
    {
      "id": 2,
      "nome": "Don Quixote",
      "titulo": "Don Quixote: A Paixão e a Aventura do Cavaleiro da Triste Figura",
      "resumo": "O ballet 'Don Quixote' é uma obra vibrante e cômica (coreografia de Marius Petipa, música de Ludwig Minkus), que se baseia em uma seção do romance de Cervantes. A trama foca no romance de Kitri, a filha do estalajadeiro, e o barbeiro Basílio, que enfrentam a oposição do pai dela, Lourenço, que quer casá-la com o nobre rico Gamache. O cavaleiro sonhador Dom Quixote e seu escudeiro Sancho Pança se envolvem nas peripécias do casal, que eventualmente consegue se casar após Basílio encenar um falso suicídio. O ballet é célebre pelo seu virtuosismo técnico e pelas danças de estilo espanhol, culminando no famoso e espetacular Grand Pas de Deux no casamento.",
      "origens": "O ballet de repertório Don Quixote é uma obra clássica e vibrante, baseada no famoso romance espanhol Dom Quixote de la Mancha de Miguel de Cervantes. A versão mais celebrada, que se tornou um pilar do repertório mundial, estreou em 1869 no Teatro Bolshoi de Moscou, Rússia, com coreografia original do lendário Marius Petipa e música composta por Ludwig Minkus. Embora Petipa tenha se concentrado principalmente em um sub-enredo sobre o romance dos jovens Kitri e Basílio, a obra captura o espírito aventureiro e cômico do cavaleiro Dom Quixote e seu fiel escudeiro Sancho Pança, incorporando o sabor e as danças características da Espanha, como o fandango, em uma coreografia repleta de virtuosismo.",
      "trama": "O ballet Don Quixote narra a história do fidalgo sonhador que, lendo romances de cavalaria, decide se tornar um cavaleiro andante e parte em busca de aventuras com seu escudeiro, Sancho Pança (Prólogo). A trama principal se desenrola em torno do romance da jovem Kitri, filha do estalajadeiro Lourenço, e o barbeiro Basílio, que se amam, mas são impedidos por Lourenço, que deseja que Kitri se case com o nobre e rico Gamache (Ato I). Don Quixote e Sancho chegam à praça e o Cavaleiro, confundindo Lourenço com o senhor de um castelo e Kitri com sua amada Dulcinéia, acaba por ajudar Kitri e Basílio a fugirem durante as festividades. Lourenço, Gamache e Don Quixote partem em perseguição (Ato I). Ao serem alcançados em uma estalagem, Basílio finge um suicídio para comover Lourenço e, com a intervenção de Don Quixote, consegue o consentimento do pai para se casar com Kitri, revelando em seguida que tudo não passou de uma farsa (Ato II, Cena 1). Ainda em suas jornadas, Don Quixote se depara com moinhos de vento, que ele confunde com gigantes, e os ataca, sendo arremessado e caindo inconsciente (Ato II, Cena 2). Ferido, ele tem um sonho fantástico no Jardim de Dulcinéia, onde vê sua amada cercada por dríades (Ato III, Cenas 1 e 2). A história culmina em um castelo ducal, onde Don Quixote é desafiado para um duelo pelo Cavaleiro da Branca Lua, que o derrota e o obriga, por juramento, a abandonar a cavalaria andante. O Cavaleiro vitorioso se revela ser o bacharel Sansão Carrasco, que força Don Quixote a retornar para casa (Ato IV).",
      "coreografia": "A coreografia do ballet Don Quixote, na versão de Marius Petipa (1869), é mundialmente famosa por sua explosão de virtuosismo e seu vibrante estilo espanhol. Petipa infundiu na obra não apenas a técnica clássica russa, mas também incorporou pas de caractère e danças folclóricas espanholas, como o vigoroso Fandango e as marcantes movimentações dos toureiros. A coreografia exige extrema agilidade e brilho técnico, especialmente dos protagonistas. O destaque inquestionável é o famoso Grand Pas de Deux do Ato III (festa de casamento de Kitri e Basílio), que se tornou uma peça de concerto autônoma, célebre pelos fouettés impressionantes de Kitri e pelos pirouettes e saltos espetaculares de Basílio, culminando em uma dança de celebração e pura alegria técnica.",
      "legado": "O legado do ballet Don Quixote reside em sua capacidade de unir o rigor do balé clássico acadêmico com a vivacidade teatral das danças de caráter e folclóricas, estabelecendo um modelo para futuros ballets de repertório que buscam equilíbrio entre narrativa e exibição técnica. A coreografia de Marius Petipa, particularmente por meio do seu icônico e frequentemente apresentado Grand Pas de Deux, cimentou-se como um dos maiores desafios e provas de fogo para bailarinos principais em todo o mundo, simbolizando o ápice do virtuosismo masculino e feminino. Além disso, ao focar na história de Kitri e Basílio em vez da jornada filosófica do próprio Dom Quixote, o ballet garantiu uma peça de entretenimento universal, repleta de comédia, romance e cor, assegurando sua permanência como um dos ballets mais amados, dançados e adaptados no repertório das grandes companhias.",
      "imagem": "assets/Img/donQ.jpeg",
      "localizacao": {
        "cidade": "Moscou",
        "pais": "Rússia",
        "teatro": "Teatro Bolshoi",
        "latitude": 55.7596,
        "longitude": 37.619,
        "ano": 1869
      },
      "mais_imagens": [
        {
          "id": 1,
          "imagem": "assets/Img/don-quixote/donQ1.jpg"
        },
        {
          "id": 2,
          "imagem": "assets/Img/don-quixote/donQ2.jpg"
        },
        {
          "id": 3,
          "imagem": "assets/Img/don-quixote/donQ3.jpg"
        }
      ]
    },
    {
      "id": 3,
      "nome": "A Bela Adormecida",
      "titulo": "A História do Ballet A Bela Adormecida",
      "resumo": "Inspirado no Conto de Fadas de Charles Perrault, o Balé A Bela Adormecida foi criado em 1980. A adaptação contou com a composição do russo Peter Ilych Tchaikovsky, libreto de Marius Petipa e Ivan Vsevolojsky, e coreografia de Marius Petipa. Foi considerado um marco da cultura russa do século 19. Contendo um prólogo e três atos, teve sua estreia no Teatro Mariinsky em São Petersburgo. ",
      "origens": "O ballet 'A Bela Adormecida' ('The Sleeping Beauty') é universalmente considerado o ápice do balé clássico, tendo estreado em 1890 no Teatro Mariinsky em São Petersburgo, Rússia. A obra é uma colaboração monumental entre o lendário coreógrafo Marius Petipa e o compositor Pyotr Ilyich Tchaikovsky, marcando o segundo de seus três ballets (o primeiro sendo O Lago dos Cisnes). Petipa baseou sua coreografia na versão do conto de fadas de Charles Perrault, utilizando a música grandiosa de Tchaikovsky para construir uma das partituras mais ricas e intrincadas da história da dança. Desde sua estreia, é reverenciada pela sua escala épica, pela complexidade e simetria de seus corps de ballet e pela exigência técnica de seus papéis principais, como a Princesa Aurora.",
      "trama": "Prólogo - O Batizado <br> O rei Florestan e a rainha convidaram todas as fadas para serem as madrinhas do batizado de sua filha recém-nascida, Aurora. Enquanto as fadas oferecem seus presentes à bebé, um trovão anuncia a chegada da terrível fada Carabosse, que o mestre de cerimônias esqueceu de incluir na lista de convidados. Ultrajada, Carabosse anuncia que também irá dar um presente à bebê: quando Aurora completar 16 anos, ela iria se picar com uma agulha no dedo e então mergulhará num sono eterno. Felizmente uma das fadas madrinhas ainda não havia dado o seu presente, e então contraria Carabosse, prometendo que Aurora não irá mergulhar num sono eterno e sim cairá num sono que durará até que um príncipe a desperte com um beijo e se case com ela. Como precaução, o rei proíbe todos os objetos aguçados no seu reino. <br><br> Ato I - O Feitiço <br> Aurora completou 16 anos. Quatro príncipes vieram pedir a sua mão em casamento. A corte reúne-se nos jardins e os camponeses e crianças dançam com as grinaldas de flores. A princesa dança com os seus pretendentes. Entra em cena uma velha que lhe oferece um ramo de rosas. Aurora aceita o presente e encontra uma agulha entre as rosas, um objeto que nunca havia visto. Segura na mão e, durante a dança acidentalmente, pica-se num dedo. Parece desmaiar, mas depois recompõe-se. A dança torna-se vertiginosa e Aurora desmaia de vez. Neste momento, a velha tira o seu disfarce e se revela Carabosse, exultante por ter se cumprido o seu feitiço. Mas de imediato surge a fada lilás para reafirmar também a sua promessa. Um véu cai sobre a cena e cresce uma floresta mágica para esconder o castelo, o reino e todos os seus arredores. <br><br> Ato II - A visão <br> Passaram-se 100 anos. O príncipe Désiré caça na floresta mágica. Num momento em que se afasta do seu grupo, a fada Lilás, que também é sua madrinha, mostra-lhe a imagem da princesa. Désiré implora à fada Lilás que o leve para junto de Aurora, assim os dois viajam num barco encantado até ao palácio. Seguindo a fada, Desiré entra no quarto onde dorme Aurora, no meio da corte enfeitiçada. Desperta-a com um beijo e todos acordam de volta à vida. Désiré pede a mão de Aurora em casamento e o rei Florestan e a rainha concedem-na com alegria. <br><br> Ato III - O Casamento <br> A princesa casa-se com o príncipe e vivem felizes para sempre.",
      "coreografia": "A coreografia de 'A Bela Adormecida', criada por Marius Petipa, é uma obra-prima de rigor acadêmico e considerada a epítome do estilo clássico-imperial russo, servindo como a base técnica para a maioria das escolas de balé. Ela se caracteriza por um vocabulário de movimento vasto e sofisticado, que exige do corps de ballet precisão geométrica e simetria absoluta, especialmente nos atos do batizado e do casamento. O papel da Princesa Aurora é lendário por sua extrema dificuldade técnica e musicalidade, notadamente no icônico 'Pas de Deux da Rosa' (Ato I), onde ela executa seis equilíbrios sustentados (attitudes) com um pretendente diferente, testando sua estabilidade e graça. O último ato, focado no casamento, é uma celebração de virtuosismo, apresentando divertissements de contos de fadas (como O Gato de Botas e o Pássaro Azul) e culminando no grandioso Grand Pas de Deux final, que exige força, equilíbrio e brio dos protagonistas.",
      "legado": "O legado de 'A Bela Adormecida' é monumental, sendo a obra frequentemente citada como a joia da coroa do balé clássico e um testamento da colaboração perfeita entre Marius Petipa e Tchaikovsky. Sua estrutura em quatro atos, com a combinação de coreografia clássica rigorosa, o uso complexo do corps de ballet e o desenvolvimento dramático dos personagens, estabeleceu o padrão para o ballet de longa-metragem no final do século XIX. A exigência técnica do papel de Aurora e a perfeição de suas danças definiram o ideal da prima ballerina, enquanto a música rica e sinfônica de Tchaikovsky é essencialmente a trilha sonora de todo o gênero. A peça serve como a espinha dorsal do repertório da maioria das grandes companhias, sendo utilizada como uma medida da excelência técnica e artística de qualquer escola ou corpo de baile.",
      "imagem": "assets/Img/bela_adormecida.png",
      "localizacao": {
        "cidade": "São Petersburgo",
        "pais": "Rússia",
        "teatro": "Teatro Mariinsky",
        "latitude": 59.9251,
        "longitude": 30.2956,
        "ano": 1890
      },
      "mais_imagens": [
        {
          "id": 1,
          "imagem": "assets/Img/sleeping-beauty/sleepingB1.jpg"
        },
        {
          "id": 2,
          "imagem": "assets/Img/sleeping-beauty/sleepingB2.jpg"
        },
        {
          "id": 3,
          "imagem": "assets/Img/sleeping-beauty/sleepingB3.jpg"
        }
      ]
    },
    {
      "id": "4",
      "nome": "O Quebra Nozes",
      "titulo": "Quebra Nozes: A Magia do Natal em Forma de Ballet",
      "resumo": "O ballet 'O Quebra-Nozes' (1892, coreografia de Ivanov e música de Tchaikovsky) é um clássico natalino que narra a história da jovem Clara (ou Marie) que, na véspera de Natal, recebe um boneco quebra-nozes de seu padrinho, Drosselmeyer. À meia-noite, ela testemunha seu boneco ganhar vida e liderar uma batalha contra o Rei dos Camundongos. Após a vitória, o Quebra-Nozes se transforma em um Príncipe que a leva a uma viagem mágica pelo Reino das Neves e ao deslumbrante Reino dos Doces, onde eles são honrados com uma série de danças de caráter e o famoso Grand Pas de Deux da Fada Açucarada, culminando com Clara acordando e percebendo que tudo foi um lindo sonho.",
      "origens": "O ballet 'O Quebra-Nozes' (The Nutcracker) teve sua estreia mundial em 18 de dezembro de 1892, no Teatro Mariinsky, em São Petersburgo, Rússia. A obra nasceu de uma colaboração entre o compositor Pyotr Ilyich Tchaikovsky e o coreógrafo Marius Petipa, baseada em uma versão francesa suavizada do conto sombrio 'O Quebra-Nozes e o Rei dos Camundongos', de E.T.A. Hoffmann, recontado por Alexandre Dumas (pai). Embora a recepção inicial não tenha sido calorosa, a beleza da partitura de Tchaikovsky – que ele inicialmente hesitou em compor devido ao tema infantil – garantiu sua sobrevivência. Devido à doença de Petipa, a maior parte da coreografia original foi finalizada por seu assistente, Lev Ivanov.",
      "trama": "A história se passa na véspera de Natal em uma casa de família alemã no século XIX. A jovem Clara (ou Masha/Marie, dependendo da versão) recebe um boneco quebra-nozes de seu padrinho, o misterioso Drosselmeyer. Após a festa, à meia-noite, Clara volta à sala de estar e testemunha o Quebra-Nozes ganhar vida e liderar um exército de soldados de brinquedo em uma batalha contra o exército do Rei dos Camundongos. Depois de ajudar o Quebra-Nozes a vencer, ele se transforma em um belo Príncipe que leva Clara em uma jornada mágica através do Reino das Neves e, finalmente, ao deslumbrante Reino dos Doces. Lá, eles são celebrados pela Fada Açucarada com um banquete de danças internacionais. No final, Clara acorda, percebendo que toda a aventura foi um sonho de Natal.",
      "coreografia": "A coreografia original, em grande parte creditada a Lev Ivanov sob as diretrizes de Petipa, é famosa por sua magia e diversidade. O primeiro ato apresenta a complexa Dança dos Flocos de Neve, um corps de ballet etéreo que evoca a atmosfera do inverno russo. O segundo ato, no Reino dos Doces, é um desfile de danças de caráter (divertissements) que representam guloseimas de diferentes nações, como a Dança Espanhola (Chocolate), a Dança Árabe (Café) e a Dança Chinesa (Chá). O ápice técnico do ballet é o Grand Pas de Deux da Fada Açucarada e seu Cavalheiro, que exibe um virtuosismo cristalino e musical, com o famoso solo da Fada Açucarada destacando-se pela precisão delicada e o uso da celesta na música.",
      "legado": "O legado de 'O Quebra-Nozes' é culturalmente imenso, tornando-se um símbolo universal do Natal e um rito de passagem anual para companhias de balé e público em todo o mundo. A obra é a principal porta de entrada para novos públicos de balé, especialmente crianças, devido à sua temática mágica e acessível. A partitura de Tchaikovsky é amplamente reconhecida, sendo o 'Valsa das Flores' e a 'Dança da Fada Açucarada' trechos musicais icônicos que transcendem o universo da dança. Além disso, o sucesso de remontagens posteriores, como a de George Balanchine, garantiu que a obra permanecesse maleável e adaptável, inspirando inúmeras interpretações ao longo dos séculos.",
      "imagem": "assets/Img/nutcracker.png",
      "localizacao": {
        "cidade": "São Petersburgo",
        "pais": "Rússia",
        "teatro": "Teatro Imperial Russo",
        "latitude": 59.9251,
        "longitude": 30.2956,
        "ano": 1890
      },
      "mais_imagens": [
        {
          "id": 1,
          "imagem": "assets/Img/nutcracker/nutcracker1.jpg"
        },
        {
          "id": 2,
          "imagem": "assets/Img/nutcracker/nutcracker2.jpg"
        },
        {
          "id": 3,
          "imagem": "assets/Img/nutcracker/nutcracker3.jpg"
        }
      ]
    }
  ],
  "usuarios": [
    {
      "id": "187cb7e5-e097-4224-8bc7-b610c855e2b1",
      "login": "admin",
      "senha": "123",
      "nome": "Administrador do Sistema",
      "email": "admin@abc.com"
    },
    {
      "id": "ec37c83d-4b7f-458d-9e10-3fda7d37cd3e",
      "login": "user",
      "senha": "123",
      "nome": "Usuario Comum",
      "email": "user@abc.com"
    }
  ]
}